Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/xc32/PIC32CZ2051CA90176/startup_pic32cz2051ca90176.c
/**
 * \file
 *
 * \brief MPLAB(R) XC32 - Startup code for PIC32CZ2051CA90176
 *
 * Copyright (c) 2023 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#if __XC32_VERSION__ >= 2300
#pragma nocodecov
#endif


#ifndef   __INLINE
#if __GNUC_GNU_INLINE__ == 1
  #define __INLINE              __inline__
#else
  #define __INLINE              inline
#endif
#endif

#ifndef   __STATIC_INLINE
  #define __STATIC_INLINE       static __INLINE
#endif

#ifndef   __STATIC_FORCEINLINE
  #define __STATIC_FORCEINLINE  __attribute__((always_inline)) static __INLINE
#endif

#include <xc.h>
#include <libpic32c.h>

#ifndef __always_inline
#define __always_inline	__attribute__((__always_inline__))
#endif

/*
 *  Define the __XC32_RESET_HANDLER_NAME macro on the command line when you
 *  want to use a different name for the Reset Handler function.
 */
#ifndef __XC32_RESET_HANDLER_NAME
#define __XC32_RESET_HANDLER_NAME Reset_Handler
#endif /* __XC32_RESET_HANDLER_NAME */

/*
*  The MPLAB X Simulator does not yet support simulation of programming the 
*  GPNVM bits yet. We can remove this once it supports the FRDY bit.
*/
#ifdef __MPLAB_DEBUGGER_SIMULATOR
#define __XC32_SKIP_STARTUP_GPNVM_WAIT
#endif
 
/*
*  This startup code relies on features that are specific to the MPLAB XC32
*  toolchain. Do not use it with other toolchains.
*/
#ifndef __XC32
#warning This startup code is intended for use with the MPLAB XC32 Compiler only.
#endif
  
#if defined ECC_INIT_START
#define START_ADDR  ECC_INIT_START
#else
#define START_ADDR  FLEXRAM_ADDR
#endif
 
#if defined ECC_INIT_LEN
#define INIT_LEN  ECC_INIT_LEN
#else
#define INIT_LEN  FLEXRAM_SIZE
#endif
 
#if defined __XC32_PIC32CZ_INIT_RAM__
 
__STATIC_INLINE void  __attribute__((optimize("-O1")))  PIC32CZ_RAM_Initialize(void)
{
    register uint64_t *pFlexRam;
 
    __DSB();
    __ISB();
 
    // FlexRAM initialization loop (to handle ECC properly)
    // we need to initialize all of RAM with 64 bit aligned writes
    for (pFlexRam = (uint64_t*)START_ADDR ; pFlexRam < ((uint64_t*)(START_ADDR + INIT_LEN)) ; pFlexRam++)
    {
        *pFlexRam = 0;
    }
 
    // ITCM initialization loop (to handle ECC properly)
    // we need to initialize all of RAM with 64 bit aligned writes
    for (pFlexRam = (uint64_t*) ITCM_ADDR ; pFlexRam < (uint64_t*)(ITCM_ADDR + ITCM_SIZE) ; pFlexRam++)
    {
        *pFlexRam = 0;
    }
    // DTCM initialization loop (to handle ECC properly)
    // we need to initialize all of RAM with 64 bit aligned writes
    for (pFlexRam = (uint64_t*) DTCM_ADDR ; pFlexRam < (uint64_t*)(DTCM_ADDR + DTCM_SIZE) ; pFlexRam++)
    {
        *pFlexRam = 0;
    }
 
 
 
    __DSB();
    __ISB();
}
 
#endif

/* Initialize segments */
extern uint32_t __svectors;
extern uint32_t _stack;
extern uint32_t _dinit_size;
extern uint32_t _dinit_addr;

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
/* We pass (0, NULL) for the arguments just in case, but applications
 * are expected to use main(void) as their prototype.  Thus, passing
 * NULL for argv is valid.
 */
extern int main(int, char **);
/** \endcond */

extern void __attribute__((long_call)) __libc_init_array(void);

/* Default empty handler */
void __attribute__((weak, used, optimize("-O1"), long_call, externally_visible)) Dummy_Handler(void);

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wredundant-decls"

/* Reset handler and application-provided reset handler */
void __attribute__((weak, optimize("-O1"), long_call, naked, externally_visible)) Reset_Handler(void);
extern void __attribute__((weak, used, long_call)) __XC32_RESET_HANDLER_NAME(void);

#pragma GCC diagnostic pop

/* Cortex-M7 core handlers */
void NonMaskableInt_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HardFault_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MemoryManagement_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void BusFault_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UsageFault_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SVCall_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PendSV_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SysTick_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void FCW_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCR_ECCERR_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCR_CRC_FAULT_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PM_Handler                ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SUPC_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_FAIL_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_XOSCRDY_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_DFLLRDY_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_OTHER_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_LOCK_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSC32KCTRL_FAIL_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSC32KCTRL_RDY_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MCLK_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FREQM_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void WDT_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_TAMPER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_OVF_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_PERIOD_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_COMPARE_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_0_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_1_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_2_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_3_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_4_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_5_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_6_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_7_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_8_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_9_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_10_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_11_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_12_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_13_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_14_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_15_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PAC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DRMTCM_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MCRAMC_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRAM_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI3_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_0_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_1_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_2_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_3_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_4_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_5_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_6_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_7_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_8_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_9_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_10_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_11_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved111_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved112_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved113_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved114_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved115_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved116_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved117_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved118_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved119_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved120_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved121_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved122_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved123_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved124_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC3_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC4_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC5_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC6_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC7_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC3_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC4_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC5_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC6_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC7_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC3_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC4_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC5_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_OTHER_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_CNT_TRIG_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC3_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC4_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC5_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_GLOBAL_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AC_Handler                ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PTC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SPI_IXS0_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SPI_IXS1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN3_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN4_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN5_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved200_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved201_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_0_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_1_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_2_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_3_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_4_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_5_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SQI0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SQI1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRNG_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SDMMC0_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SDMMC1_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USBHS0_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
